{"format": "layers-model", "generatedBy": "keras v2.12.0", "convertedBy": "TensorFlow.js Converter v4.5.0", "modelTopology": {"keras_version": "2.12.0", "backend": "tensorflow", "model_config": {"class_name": "Sequential", "config": {"name": "sequential_2", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 720, 720, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "flatten_2_input"}}, {"class_name": "Flatten", "config": {"name": "flatten_2", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 720, 720, 3], "data_format": "channels_last"}}, {"class_name": "Dense", "config": {"name": "dense_4", "trainable": true, "dtype": "float32", "units": 128, "activation": "relu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}, {"class_name": "Dense", "config": {"name": "dense_5", "trainable": true, "dtype": "float32", "units": 2, "activation": "softmax", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}}]}}, "training_config": {"loss": "sparse_categorical_crossentropy", "metrics": [[{"class_name": "MeanMetricWrapper", "config": {"name": "accuracy", "dtype": "float32", "fn": "sparse_categorical_accuracy"}}]], "weighted_metrics": null, "loss_weights": null, "optimizer_config": {"class_name": "Custom>Adam", "config": {"name": "Adam", "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "jit_compile": false, "is_legacy_optimizer": false, "learning_rate": 0.0010000000474974513, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}}, "weightsManifest": [{"paths": ["group1-shard1of190.bin", "group1-shard2of190.bin", "group1-shard3of190.bin", "group1-shard4of190.bin", "group1-shard5of190.bin", "group1-shard6of190.bin", "group1-shard7of190.bin", "group1-shard8of190.bin", "group1-shard9of190.bin", "group1-shard10of190.bin", "group1-shard11of190.bin", "group1-shard12of190.bin", "group1-shard13of190.bin", "group1-shard14of190.bin", "group1-shard15of190.bin", "group1-shard16of190.bin", "group1-shard17of190.bin", "group1-shard18of190.bin", "group1-shard19of190.bin", "group1-shard20of190.bin", "group1-shard21of190.bin", "group1-shard22of190.bin", "group1-shard23of190.bin", "group1-shard24of190.bin", "group1-shard25of190.bin", "group1-shard26of190.bin", "group1-shard27of190.bin", "group1-shard28of190.bin", "group1-shard29of190.bin", "group1-shard30of190.bin", "group1-shard31of190.bin", "group1-shard32of190.bin", "group1-shard33of190.bin", "group1-shard34of190.bin", "group1-shard35of190.bin", "group1-shard36of190.bin", "group1-shard37of190.bin", "group1-shard38of190.bin", "group1-shard39of190.bin", "group1-shard40of190.bin", "group1-shard41of190.bin", "group1-shard42of190.bin", "group1-shard43of190.bin", "group1-shard44of190.bin", "group1-shard45of190.bin", "group1-shard46of190.bin", "group1-shard47of190.bin", "group1-shard48of190.bin", "group1-shard49of190.bin", "group1-shard50of190.bin", "group1-shard51of190.bin", "group1-shard52of190.bin", "group1-shard53of190.bin", "group1-shard54of190.bin", "group1-shard55of190.bin", "group1-shard56of190.bin", "group1-shard57of190.bin", "group1-shard58of190.bin", "group1-shard59of190.bin", "group1-shard60of190.bin", "group1-shard61of190.bin", "group1-shard62of190.bin", "group1-shard63of190.bin", "group1-shard64of190.bin", "group1-shard65of190.bin", "group1-shard66of190.bin", "group1-shard67of190.bin", "group1-shard68of190.bin", "group1-shard69of190.bin", "group1-shard70of190.bin", "group1-shard71of190.bin", "group1-shard72of190.bin", "group1-shard73of190.bin", "group1-shard74of190.bin", "group1-shard75of190.bin", "group1-shard76of190.bin", "group1-shard77of190.bin", "group1-shard78of190.bin", "group1-shard79of190.bin", "group1-shard80of190.bin", "group1-shard81of190.bin", "group1-shard82of190.bin", "group1-shard83of190.bin", "group1-shard84of190.bin", "group1-shard85of190.bin", "group1-shard86of190.bin", "group1-shard87of190.bin", "group1-shard88of190.bin", "group1-shard89of190.bin", "group1-shard90of190.bin", "group1-shard91of190.bin", "group1-shard92of190.bin", "group1-shard93of190.bin", "group1-shard94of190.bin", "group1-shard95of190.bin", "group1-shard96of190.bin", "group1-shard97of190.bin", "group1-shard98of190.bin", "group1-shard99of190.bin", "group1-shard100of190.bin", "group1-shard101of190.bin", "group1-shard102of190.bin", "group1-shard103of190.bin", "group1-shard104of190.bin", "group1-shard105of190.bin", "group1-shard106of190.bin", "group1-shard107of190.bin", "group1-shard108of190.bin", "group1-shard109of190.bin", "group1-shard110of190.bin", "group1-shard111of190.bin", "group1-shard112of190.bin", "group1-shard113of190.bin", "group1-shard114of190.bin", "group1-shard115of190.bin", "group1-shard116of190.bin", "group1-shard117of190.bin", "group1-shard118of190.bin", "group1-shard119of190.bin", "group1-shard120of190.bin", "group1-shard121of190.bin", "group1-shard122of190.bin", "group1-shard123of190.bin", "group1-shard124of190.bin", "group1-shard125of190.bin", "group1-shard126of190.bin", "group1-shard127of190.bin", "group1-shard128of190.bin", "group1-shard129of190.bin", "group1-shard130of190.bin", "group1-shard131of190.bin", "group1-shard132of190.bin", "group1-shard133of190.bin", "group1-shard134of190.bin", "group1-shard135of190.bin", "group1-shard136of190.bin", "group1-shard137of190.bin", "group1-shard138of190.bin", "group1-shard139of190.bin", "group1-shard140of190.bin", "group1-shard141of190.bin", "group1-shard142of190.bin", "group1-shard143of190.bin", "group1-shard144of190.bin", "group1-shard145of190.bin", "group1-shard146of190.bin", "group1-shard147of190.bin", "group1-shard148of190.bin", "group1-shard149of190.bin", "group1-shard150of190.bin", "group1-shard151of190.bin", "group1-shard152of190.bin", "group1-shard153of190.bin", "group1-shard154of190.bin", "group1-shard155of190.bin", "group1-shard156of190.bin", "group1-shard157of190.bin", "group1-shard158of190.bin", "group1-shard159of190.bin", "group1-shard160of190.bin", "group1-shard161of190.bin", "group1-shard162of190.bin", "group1-shard163of190.bin", "group1-shard164of190.bin", "group1-shard165of190.bin", "group1-shard166of190.bin", "group1-shard167of190.bin", "group1-shard168of190.bin", "group1-shard169of190.bin", "group1-shard170of190.bin", "group1-shard171of190.bin", "group1-shard172of190.bin", "group1-shard173of190.bin", "group1-shard174of190.bin", "group1-shard175of190.bin", "group1-shard176of190.bin", "group1-shard177of190.bin", "group1-shard178of190.bin", "group1-shard179of190.bin", "group1-shard180of190.bin", "group1-shard181of190.bin", "group1-shard182of190.bin", "group1-shard183of190.bin", "group1-shard184of190.bin", "group1-shard185of190.bin", "group1-shard186of190.bin", "group1-shard187of190.bin", "group1-shard188of190.bin", "group1-shard189of190.bin", "group1-shard190of190.bin"], "weights": [{"name": "dense_4/kernel", "shape": [1555200, 128], "dtype": "float32"}, {"name": "dense_4/bias", "shape": [128], "dtype": "float32"}, {"name": "dense_5/kernel", "shape": [128, 2], "dtype": "float32"}, {"name": "dense_5/bias", "shape": [2], "dtype": "float32"}]}]}